Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/extending.tmx
Source language: en
Languages: pl

source: This code loads a Python script using ``argv[1]``, and calls the function named in ``argv[2]``. Its integer arguments are the other values of the ``argv`` array. If you compile and link this program (let's call the finished executable :program:`call`), and use it to execute a Python script, such as::
pl: Ten kod ładuje skrypt języka pytonowskiego używając ``argv[1]``, i wywołuje zadanie nazwane w ``argv[2]``. Jego całkowitymi parametrami są inne wartości tablicy ``argv``. Jeśli skompilujesz i podłączysz ten program (nazwijmy skończony plik wykonywalny :program:`wywołaniem` - z ang. - :program:`call`) i użyjemy go do wywołania skryptu języka pytonowskiego, takiego jak::

source: def multiply(a,b): print("Will compute", a, "times", b) c = 0 for i in range(0, a): c = c + b return c
pl: def mnozenie(a,b): print("Policzy", a, "razy", b) c = 0 for i in range(0, a): c = c + b return c

source: then the result should be::
pl: Wtedy wynik powinien być::

source: $ call multiply multiply 3 2 Will compute 3 times 2 Result of call: 6
pl: $ wywolanie mnozenie mnozenie 3 2 Policzy 3 razy 2 Wynik wywołania: 6

source: Although the program is quite large for its functionality, most of the code is for data conversion between Python and C, and for error reporting. The interesting part with respect to embedding Python starts with ::
pl: Chociaż program jest całkiem spory jak na jego skromne działanie, większość kodu jest dla zamiany danych pomiędzy językiem pytonowskim i C, i dla zgłaszania błędów. Interesująca część z punktu widzenia załączania języka pytonowskiego zaczyna się od::

source: Py_Initialize(); pName = PyString_FromString(argv[1]); /* Error checking of pName left out */ pModule = PyImport_Import(pName);
pl: Py_Initialize(); pNazwa = PyString_FromString(argv[1]); /* Sprawdzanie błędów pNazwa pominięte */ pModule = PyImport_Import(pNazwa);

source: After initializing the interpreter, the script is loaded using :cfunc:`PyImport_Import`. This routine needs a Python string as its argument, which is constructed using the :cfunc:`PyString_FromString` data conversion routine. ::
pl: Po zainicjowaniu interpretera, skrypt jest ładowany używając :cfunc:`PyImport_Import`. To zadanie wymaga ciągu znaków języka pytonowskiego jako jego parametru, które są tworzone używając :cfunc:`PyString_FromString` zadania zamiany danych. ::

source: pFunc = PyObject_GetAttrString(pModule, argv[2]); /* pFunc is a new reference */ if (pFunc && PyCallable_Check(pFunc)) { ... } Py_XDECREF(pFunc);
pl: pFunc = PyObject_GetAttrString(pModule, argv[2]); /* pFunc jest nowym odniesieniem */ if (pFunc && PyCallable_Check(pFunc)) { ... } Py_XDECREF(pFunc);

source: Once the script is loaded, the name we're looking for is retrieved using :cfunc:`PyObject_GetAttrString`. If the name exists, and the object returned is callable, you can safely assume that it is a function. The program then proceeds by constructing a tuple of arguments as normal. The call to the Python function is then made with::
pl: Gdy skrypt jest załadowany, nazwa na którą patrzymy jest pobierana używając :cfunc:`PyObject_GetAttrString`. Jeśli nazwa istnieje, i przedmiot zwracany jest wywoływalny, można bezpiecznie założyć że jest on zadaniem. Program potem postępuje naprzód tworząc dwójkę parametrów w zwyczajny sposób. Wywołanie zadania języka pytonowskiego jest potem wykonywane za pomocą::

source: Upon return of the function, ``pValue`` is either *NULL* or it contains a reference to the return value of the function. Be sure to release the reference after examining the value.
pl: Na powrót z zadania, ``pValue`` jest albo *pusta* - z ang. - *NULL* albo zawiera odniesienia do wartości zwracanej z zadania. Upewnij się że uwalniasz odniesienie po przetestowaniu wartości.

source: Extending Embedded Python
pl: Rozszerzanie załączonego języka pytonowskiego

source: Until now, the embedded Python interpreter had no access to functionality from the application itself. The Python API allows this by extending the embedded interpreter. That is, the embedded interpreter gets extended with routines provided by the application. While it sounds complex, it is not so bad. Simply forget for a while that the application starts the Python interpreter. Instead, consider the application to be a set of subroutines, and write some glue code that gives Python access to those routines, just like you would write a normal Python extension. For example::
pl: Jak dotąd, załączony program interpretujący polecenia języka pytonowskiego nie miał dostępu do zadań samej aplikacji. Sprzęg języka pytonowskiego pozwala na to przez rozszerzanie załączonego programu interpretującego polecenia języka pytonowskiego. To jest, załączony program interpretujący polecenia języka pytonowskiego poszerza się przez zadania dostarczone przez aplikację. Podczas gdy brzmi to skomplikowanie, nie jest to takie straszne. Po prostu zapomnij na chwilę, że aplikacja uruchamia program interpretujący polecenia języka pytonowskiego. Zamiast tego, rozważ, że aplikacja jest zbiorem podzadań i napisz trochę kodu lepiącego który daje dostęp do tych zadań, tak jakbyś pisał zwykłe rozszerzenia. Dla przykładu::

source: static int numargs=0; /* Return the number of arguments of the application command line */ static PyObject* emb_numargs(PyObject *self, PyObject *args) { if(!PyArg_ParseTuple(args, ":numargs")) return NULL; return Py_BuildValue("i", numargs); } static PyMethodDef EmbMethods[] = { {"numargs", emb_numargs, METH_VARARGS, "Return the number of arguments received by the process."}, {NULL, NULL, 0, NULL} }; static PyModuleDef EmbModule = { PyModuleDef_HEAD_INIT, "emb", NULL, -1, EmbMethods, NULL, NULL, NULL, NULL }; static PyObject* PyInit_emb(void) { return PyModule_Create(&EmbModule); }
pl: static int numargs=0; /* Zwróć liczbę parametrów wiersza poleceń aplikacji */ static PyObject* emb_numargs(PyObject *self, PyObject *args) { if(!PyArg_ParseTuple(args, ":numargs")) return NULL; return Py_BuildValue("i", numargs); } static PyMethodDef EmbMethods[] = { {"numargs", emb_numargs, METH_VARARGS, "Zwróć liczbę parametrów otrzymaną przez proces."}, {NULL, NULL, 0, NULL} }; static PyModuleDef EmbModule = { PyModuleDef_HEAD_INIT, "emb", NULL, -1, EmbMethods, NULL, NULL, NULL, NULL }; static PyObject* PyInit_emb(void) { return PyModule_Create(&EmbModule); }

source: Insert the above code just above the :cfunc:`main` function. Also, insert the following two statements before the call to :cfunc:`Py_Initialize`::
pl: Wstaw powyższy kod tuż powyżej zadania :cfunc:`main`. Także, wstaw następujące dwa wyrażenia przed odwołaniem do :cfunc:`Py_Initialize`::

source: These two lines initialize the ``numargs`` variable, and make the :func:`emb.numargs` function accessible to the embedded Python interpreter. With these extensions, the Python script can do things like ::
pl: Te dwie linie inicjują zmienną ``numargs``, i czynią zadanie :func:`emb.numargs` dostępnym dla załączonego programu interpretującego polecenia języka pytonowskiego. Z tymi rozszerzeniami, skrypt języka pytonowskiego może zrobić rzeczy takie jak::

source: import emb print("Number of arguments", emb.numargs())
pl: import emb print("Liczba parametrów", emb.numargs())

source: In a real application, the methods will expose an API of the application to Python.
pl: W realnej aplikacji, sposoby postępowania wystawią sprzęg aplikacji dla języka pytonowskiego.

source: Embedding Python in C++
pl: Załączanie języka pytonowskiego w języku C++.

source: It is also possible to embed Python in a C++ program; precisely how this is done will depend on the details of the C++ system used; in general you will need to write the main program in C++, and use the C++ compiler to compile and link your program. There is no need to recompile Python itself using C++.
pl: Jest także możliwe załączanie języka pytonowskiego w programie C++; dokładnie jak to jest robione zależy od szczegółów systemu C++ będącego w użyciu; Co do zasady, będziesz musiał napisać program główny w C++, i użyć kompilatora C++ aby skompilować i podłączyć twój program. Nie ma konieczności ponownej kompilacji języka pytonowskiego samego w sobie przy użyciu języka C++.

source: Linking Requirements
pl: Wymagania dołączania

source: While the :program:`configure` script shipped with the Python sources will correctly build Python to export the symbols needed by dynamically linked extensions, this is not automatically inherited by applications which embed the Python library statically, at least on Unix. This is an issue when the application is linked to the static runtime library (:file:`libpython.a`) and needs to load dynamic extensions (implemented as :file:`.so` files).
pl: Podczas gdy skrypt :program:`configure` dostarczony ze źródłowym kodem języka pytonowskiego będzie poprawnie budował język pytonowski aby wystawiał na zewnątrz symbole potrzebne dla dynamicznie dołączanych rozszerzeń, to nie jest automatycznie dziedziczone przez aplikacje które załączają bibliotekę języka pytonowskiego statycznie, przynajmniej w Unix-ie. To jest problemem gdy aplikacja jest dołączana do statycznej biblioteki czasu wykonania (:file:`libpython.a`) i potrzebuje załadować dynamiczne rozszerzenia (wypełnione jako pliki :file:`.so`).

source: The problem is that some entry points are defined by the Python runtime solely for extension modules to use. If the embedding application does not use any of these entry points, some linkers will not include those entries in the symbol table of the finished executable. Some additional options are needed to inform the linker not to remove these symbols.
pl: Problem polega na tym, że niektóre punkty wejścia są definiowane przez program języka pytonowskiego w czasie jego wykonania jedynie dla rozszerzających modułów dla użycia. Jeśli załączająca aplikacja nie używa żadnych z tych punktów wejścia, niektóre programy dołączające nie dołączą tych wpisów w tabeli symboli ukończonego pliku programu. Niektóre dodatkowe opcje są wymagane aby poinformować program łączący aby nie usuwać tych symboli.

source: Determining the right options to use for any given platform can be quite difficult, but fortunately the Python configuration already has those values. To retrieve them from an installed Python interpreter, start an interactive interpreter and have a short session like this::
pl: Określenie właściwych opcji do użycia dla każdej danej maszyny/środowiska może być raczej trudne, ale na szczęście konfiguracja języka pytonowskiego od razu ma te wartości. Aby otrzymać je z zainstalowanego programu interpretującego polecenia języka pytonowskiego, uruchom współdziałający z użytkownikiem program interpretujący polecenia języka pytonowskiego i weź krótką sesję taką jak ta::

source: The contents of the string presented will be the options that should be used. If the string is empty, there's no need to add any additional options. The :const:`LINKFORSHARED` definition corresponds to the variable of the same name in Python's top-level :file:`Makefile`.
pl: Zawartość ciągu znaków prezentowanego będzie opcjami które powinny być użyte. Jeśli ciąg znaków jest pusty, nie ma potrzeby dodawać żadnych dodatkowych opcji. Definicja :const:`LINKFORSHARED` odpowiada zmiennej o tej samej nazwie w nadrzędnym pliku :file:`Makefile` języka pytonowskiego.

source: Extending Python with C or C++
pl: Rozszerzanie języka pytonowskiego za pomocą C lub C++

source: It is quite easy to add new built-in modules to Python, if you know how to program in C. Such :dfn:`extension modules` can do two things that can't be done directly in Python: they can implement new built-in object types, and they can call C library functions and system calls.
pl: Jest całkiem łatwo dodać nowe wbudowane moduły do języka pytonowskiego, jeśli znasz się na programowaniu w C. Takie :dfn:`moduły rozszerzające` - z ang. - :dfn:`extension modules` mogą zrobić dwie rzeczy których nie da się zrobić bezpośrednio w języku pytonowskim: mogą wypełnić nowe wbudowane typy przedmiotów i mogą odwołać się do zadań bibliotecznych C i odwołań systemowych.

source: To support extensions, the Python API (Application Programmers Interface) defines a set of functions, macros and variables that provide access to most aspects of the Python run-time system. The Python API is incorporated in a C source file by including the header ``"Python.h"``.
pl: Aby wspierać rozszerzenia, sprzęg programowania języka pytonowskiego API - z ang. (Application Programmers Interface) określa zbiór zadań, makropoleceń i zmiennych które dostarczają dostęp do większości aspektów systemu czasu-wykonania języka pytonowskiego. Sprzęg programowania języka pytonowskiego jest załączany w źródłowym pliku C przez załączenie pliku nagłówkowego ``"Python.h"``.

source: The compilation of an extension module depends on its intended use as well as on your system setup; details are given in later chapters.
pl: Kompilacja rozszerzających modułów zależy od jego zamierzonego użycia zarówno jak też od ustawień twojego systemu; szczegóły są dane w późniejszych rozdziałach.

source: Do note that if your use case is calling C library functions or system calls, you should consider using the :mod:`ctypes` module rather than writing custom C code. Not only does :mod:`ctypes` let you write Python code to interface with C code, but it is more portable between implementations of Python than writing and compiling an extension module which typically ties you to CPython.
pl: Zauważ, że jeśli twoim przypadkiem użycia jest wezwanie zadania z biblioteki lub wywołanie systemowe, powinieneś/powinnaś rozważyć użycie modułu :mod:`ctypes` raczej zamiast pisać dostosowawczy kod C. Moduł :mod:`ctypes` pozwala nie tylko pisać kod w języku pytonowskim do sprzęgania się z kodem C, ale także jest bardziej przenośny pomiędzy wypełnieniami języka pytonowskiego niż pisanie i kompilowanie modułów rozszerzeń które typowo łączą cię z CPythonem.

source: A Simple Example
pl: Prosty przykład

source: Let's create an extension module called ``spam`` (the favorite food of Monty Python fans...) and let's say we want to create a Python interface to the C library function :cfunc:`system`. [#]_ This function takes a null-terminated character string as argument and returns an integer. We want this function to be callable from Python as follows::
pl: Stwórzmy rozszerzający moduł nazwany ``spam`` (ulubione danie fanów Monty Pytona...) i powiedzmy że chcemy stworzyć sprzęg języka pytonowskiego z bibliotecznym zadaniem C :cfunc:`system`. [#]_ To zadanie pobiera zakończony zerem ciąg znaków jako parametr i zwraca liczbę całkowitą. Chcemy aby to zadanie było wywoływane z poziomu języka pytonowskiego, w następujący sposób::

source: Begin by creating a file :file:`spammodule.c`. (Historically, if a module is called ``spam``, the C file containing its implementation is called :file:`spammodule.c`; if the module name is very long, like ``spammify``, the module name can be just :file:`spammify.c`.)
pl: Zaczynając od stworzenia pliku :file:`spammodule.c` (Historycznie, jeśli moduł był nazwany ``spam``, plik C zawierający jego wypełnienie jest nazywany :file:`spammodule.c`; jeśli nazwa modułu jest bardzo długa, jak np ``spammify``, nazwa modułu może być po prostu :file:`spammify.c`.)

source: The first line of our file can be::
pl: Pierwsza linia naszego pliku mogłaby być::

source: which pulls in the Python API (you can add a comment describing the purpose of the module and a copyright notice if you like).
pl: Które pociąga sprzęg programowania języka pytonowskiego (możesz dodać komentarz opisujący powód modułu i uwagi praw autorskich jeśli wolisz).

source: Since Python may define some pre-processor definitions which affect the standard headers on some systems, you *must* include :file:`Python.h` before any standard headers are included.
pl: Odkąd język pytonowski może definiować pewne definicje preprocesora które wpływają na standardowe nagłówki na niektórych maszynach/środowiskach, *musisz* zawrzeć plik :file:`Python.h` przed załączeniem jakichkolwiek standardowych plików nagłówkowych.

source: All user-visible symbols defined by :file:`Python.h` have a prefix of ``Py`` or ``PY``, except those defined in standard header files. For convenience, and since they are used extensively by the Python interpreter, ``"Python.h"`` includes a few standard header files: ``<stdio.h>``, ``<string.h>``, ``<errno.h>``, and ``<stdlib.h>``. If the latter header file does not exist on your system, it declares the functions :cfunc:`malloc`, :cfunc:`free` and :cfunc:`realloc` directly.
pl: Wszystkie widoczne-dla-użytkownika symbole zdefiniowane przez :file:`Python.h` mają przedrostek ``Py`` lub ``PY``, z wyjątkiem tych zdefiniowanych w standardowym pliku nagłówkowym. Dla wygody, i ponieważ są one użyte szeroko przez program interpretujący polecenia języka pytonowskiego, ``"Python.h"`` zawiera kilka standardowych plików nagłówkowych: ``<stdio.h>``, ``<string.h>``, ``<errno.h>``, i ``<stdlib.h>``. Jeśli ostatni plik nagłówkowy nie istnieje na twojej maszynie/środowisku deklaruje zadania :cfunc:`malloc`, :cfunc:`free` i :cfunc:`realloc` bezpośrednio.

source: The next thing we add to our module file is the C function that will be called when the Python expression ``spam.system(string)`` is evaluated (we'll see shortly how it ends up being called)::
pl: Następną rzeczą którą dodajemy do naszego pliku modułu jest zadanie C które będzie wzywane gdy wyrażenie języka pytonowskiego ``spam.system(string)`` zostanie obliczone (zobaczymy niedługo, jak to się kończy wywołaniem)::

source: There is a straightforward translation from the argument list in Python (for example, the single expression ``"ls -l"``) to the arguments passed to the C function. The C function always has two arguments, conventionally named *self* and *args*.
pl: Istnieje prosta zamiana nazw z listy parametrów w języku pytonowskim (dla przykładu, pojedyncze wyrażenie ``"ls -l"``) do parametrów przekazanych do zadania C. Zadanie C zawsze ma dwa parametry, dla wygody nazywane *sam* - z ang. - *self* i *args*.

source: The *self* argument points to the module object for module-level functions; for a method it would point to the object instance.
pl: Parametr *sam* - z ang. - *self* - wskazuje na przedmiot modułu dla zadań na poziomie-modułu; dla sposobu postępowania wskazywałby na przykład przedmiotu.

source: The *args* argument will be a pointer to a Python tuple object containing the arguments. Each item of the tuple corresponds to an argument in the call's argument list. The arguments are Python objects --- in order to do anything with them in our C function we have to convert them to C values. The function :cfunc:`PyArg_ParseTuple` in the Python API checks the argument types and converts them to C values. It uses a template string to determine the required types of the arguments as well as the types of the C variables into which to store the converted values. More about this later.
pl: Parametr *args* będzie wskaźnikiem do przedmiotu dwójki języka Pytonowskiego zawierających parametry. Każdy element dwójki odpowiada parametrowi na liście parametrów wywołania. Parametrami są przedmioty języka pytonowskiego --- w celu aby zrobić cokolwiek z nimi w naszym zadaniu C musimy zamienić je na wartości C. Zadanie :cfunc:`PyArg_ParseTuple` w sprzęgu języka pytonowskiego sprawdza typy parametrów i zamienia je na wartości C. używa ciągu znaków wzorcowego aby określić wymagane typy parametrów zarówno jak też typy zmiennych C do których zapamiętuje zamienione wartości. Więcej o tym później.

source: :cfunc:`PyArg_ParseTuple` returns true (nonzero) if all arguments have the right type and its components have been stored in the variables whose addresses are passed. It returns false (zero) if an invalid argument list was passed. In the latter case it also raises an appropriate exception so the calling function can return *NULL* immediately (as we saw in the example).
pl: :cfunc:`PyArg_ParseTuple` zwraca prawdę (nie-zero) jeśli wszystkie parametry mają prawidłowy typ i ich komponenty zostały zapamiętane w zmiennych których adresy są przekazywane. Zwraca fałsz (zero) jeśli nieprawidłowy parametr był przekazany. W przypadku drugim podnosi też odpowiedni wyjątek tak, że wywołanie zadania może zwrócić *NULL* natychmiast (jak widzieliśmy w przykładzie).

source: Intermezzo: Errors and Exceptions
pl: Intermezzo: Błędy i Wyjątki

source: An important convention throughout the Python interpreter is the following: when a function fails, it should set an exception condition and return an error value (usually a *NULL* pointer). Exceptions are stored in a static global variable inside the interpreter; if this variable is *NULL* no exception has occurred. A second global variable stores the "associated value" of the exception (the second argument to :keyword:`raise`). A third variable contains the stack traceback in case the error originated in Python code. These three variables are the C equivalents of the result in Python of :meth:`sys.exc_info` (see the section on module :mod:`sys` in the Python Library Reference). It is important to know about them to understand how errors are passed around.
pl: Istotną konwencją w programie interpretującym polecenia języka pytonowskiego jest następująca: gdy zadanie zawiedzie, powinno ustawić warunek wyjątku i zwrócić wartość błędu (zwykle pusty wskaźnik - z ang. - *NULL* ) Wyjątki są przechowywane w statycznej nadrzędnej zmiennej wewnątrz programu interpretującego polecenia języka pytonowskiego; jeśli ta zmienna jest *NULL* żaden wyjątek nie nastąpił. Druga nadrzędna zmienna przechowuje "związaną wartość" wyjątku (drugi parametr słowa kluczowego :keyword:`raise` - z ang. zgłoś). Trzecia zmienna zawiera wypis śladu ze sterty w razie gdyby błąd wypływał z kodu w języku pytonowskim. Te trzy zmienne są równoważnikami C wyniku w języku pytonowskim sposobu postępowania :meth:`sys.exc_info` (zobacz sekcję o module :mod:`sys` w podręczniku biblioteki języka pytonowskiego). Istotne jest wiedzieć o nich aby rozumieć jak błędy są przekazywane.

source: The Python API defines a number of functions to set various types of exceptions.
pl: Sprzęg języka pytonowskiego określa pewien zestaw zadań do ustawiania różnych rodzajów wyjątków.

source: The most common one is :cfunc:`PyErr_SetString`. Its arguments are an exception object and a C string. The exception object is usually a predefined object like :cdata:`PyExc_ZeroDivisionError`. The C string indicates the cause of the error and is converted to a Python string object and stored as the "associated value" of the exception.
pl: Najbardziej rozpowszechniony to :cfunc:`PyErr_SetString`. Jego parametry to przedmiot wyjątku i ciąg znaków z języka C. Przedmiot wyjątku jest zwykle predefiniowanym przedmiotem jak :cdata:`PyExc_ZeroDivisionError`. Ciąg znków C wskazuje na powód błędu i jest zamieniany na przedmiot ciągu znaków języka pytonowskiego i zachowywany jako "wartość związana" tego wyjątku.

source: Another useful function is :cfunc:`PyErr_SetFromErrno`, which only takes an exception argument and constructs the associated value by inspection of the global variable :cdata:`errno`. The most general function is :cfunc:`PyErr_SetObject`, which takes two object arguments, the exception and its associated value. You don't need to :cfunc:`Py_INCREF` the objects passed to any of these functions.
pl: Innym użytecznym zadaniem jest :cfunc:`PyErr_SetFromErrno`, który pobiera tylko parametr wyjątku i konstruuje związaną wartość przez podejrzenie zmiennej nadrzędnej :cdata:`errno`. Najogólniejszym zadaniem jest :cfunc:`PyErr_SetObject` które pobiera dwa parametry przedmiotowe, wyjątek i związaną wartość. Nie potrzebują one zwiększać ilości odniesień :cfunc:`Py_INCREF` przedmiotów przekazanych do którychkolwiek z tych zadań.
